Revit.Elements.CurtainGrid
A Revit CurtainGrid

Revit.Elements.CurtainGrid.#ctor(Autodesk.Revit.DB.Element)
Create from an existing Revit Element
curtainHolderElement:

Revit.Elements.CurtainGrid.InitCurtainGrid(Autodesk.Revit.DB.Element)
Initialize a curtain grid
curtainHolderElement:

Revit.Elements.CurtainGrid.InitCurtainGrid(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Reference)
Initialize a CurtainGrid element
curtainHolderElement:
faceReference:

Revit.Elements.CurtainGrid.ByElementAndReference(Revit.Elements.Element,Revit.GeometryReferences.ElementFaceReference)
get curtain grid from element with curtain grid or grids
curtainHolderElement:
elementFaceReference:

Revit.Elements.CurtainGrid.ByElement(Revit.Elements.Element)
get curtain grid from element with curtain grid or grids
curtainHolderElement:

Revit.Elements.CurtainGrid.InternalCurtainHolderElement
Internal variable containing the wrapped Revit object

Revit.Elements.CurtainGrid.InternalElement
Reference to the Element

Revit.Elements.CurtainGrid.NumberOfULines
number of U lines

Revit.Elements.CurtainGrid.NumberOfVLines
number of V lines

Revit.Elements.CurtainGrid.NumberOfPanels
number of V lines

Revit.Elements.CurtainGrid.NumberOfMullions
number of V lines